kein0r/CC2530Bee/main.c
  /* General radio configuration */
  config->IEEE802154_config.Channel = CC2530BEE_Default_Channel;
  config->IEEE802154_config.PanID = CC2530BEE_Default_PanID;
  config->IEEE802154_config.shortAddress = CC2530BEE_Default_ShortAddress;
  
  /* prepare header for IEEE 802.15.4 Tx message. Values are stored in config but must be copied 
   * to #IEEE802154_TxDataFrame in order to be effective. */
  IEEE802154_TxDataFrame.fcf.frameType = IEEE802154_FCF_FRAME_TYPE_DATA;  /* 3: 0x01 */
  IEEE802154_TxDataFrame.fcf.securityEnabled = IEEE802154_FCF_SECURITY_DISABLED; /* 1: 0x0 */
  IEEE802154_TxDataFrame.fcf.framePending = 0x0; /* 1:0x0 */
  IEEE802154_TxDataFrame.fcf.ackRequired = IEEE802154_FCF_ACKNOWLEDGE_REQUIRED; /* 1: 0x1 */
#ifdef IEEE802154_ENABLE_PANID_COMPRESSION
  IEEE802154_TxDataFrame.fcf.panIdCompression = IEEE802154_FCF_PANIDCOMPRESSION_ENABLED; /* 1: 0x1 */
#else
  IEEE802154_TxDataFrame.fcf.panIdCompression = IEEE802154_FCF_PANIDCOMPRESSION_DISABLED; /* 1: 0x0 */
#endif
  IEEE802154_TxDataFrame.fcf.destinationAddressMode = CC2530BEE_Default_DestinationAdressingMode;
  IEEE802154_TxDataFrame.fcf.frameVersion = 0x00;
  IEEE802154_TxDataFrame.fcf.sourceAddressMode = CC2530BEE_Default_SourceAdressingMode;
  /* preset variable to some meaningfull values */
  IEEE802154_TxDataFrame.sequenceNumber = 0x00;
  IEEE802154_TxDataFrame.destinationPANID = CC2530BEE_Default_PanID;
  IEEE802154_TxDataFrame.destinationAddress.shortAddress = 0xffff;   /* broadcast */
  IEEE802154_TxDataFrame.sourceAddress.shortAddress = CC2530BEE_Default_ShortAddress;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[0] = IEEE_EXTENDED_ADDRESS0;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[1] = IEEE_EXTENDED_ADDRESS1;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[2] = IEEE_EXTENDED_ADDRESS2;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[3] = IEEE_EXTENDED_ADDRESS3;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[4] = IEEE_EXTENDED_ADDRESS4;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[5] = IEEE_EXTENDED_ADDRESS5;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[6] = IEEE_EXTENDED_ADDRESS6;
  IEEE802154_TxDataFrame.sourceAddress.extendedAdress[7] = IEEE_EXTENDED_ADDRESS7;
  
  config->RO_PacketizationTimeout = CC2530BEE_Default_RO_PacketizationTimeout * 10;
  
}

/**
 * Receives a frame via USART, un-escapes the data, copy the result to data
 * pointer of frame and calculates crc.
 * This function used blocking USART_getc function to read data from UART. Also 
 * make sure that enough space is be provided in frame->data pointer to receive
 * frame.
 * @param frame UART API frame with pre-filled header
 * @return UARTFrame_CRC_OK if crc matched, UARTFrame_CRC_Not_OK else
 */
uint8_t UARTAPI_receiveFrame(APIFrame_t *frame)
{
  APIFramePayload_t *dataPtr = frame->data;
  uint8_t crc = 0;
  for (uint16_t i=0; i<frame->header.length; i++)
  {
    USART_getc((char *) dataPtr);
    /* if needed un-escape the data */
    if ( *dataPtr == UARTFrame_Escape_Character )
    {
      USART_getc((char *) dataPtr);
      *dataPtr ^= UARTFrame_Escape_Mask;
    }
    crc += *dataPtr;
    dataPtr++;
  }
  /* Check crc. The sum of received data + received crc must be 0xff */
  USART_getc((char *) &(frame->crc));
  crc += frame->crc;
  if (crc == 0xff)
  {
    return UARTFrame_CRC_OK;
  } 
  else
  {
    return UARTFrame_CRC_Not_OK;
  }
}

/**
 * Adds correct header and CRC to global variable txAPIFrame. Precondition is 
 * that data in txAPIFrame.data was already filled.
 * @param data Pointer to data to be send out via USART
 * @param length number of bytes of data 
 */
void UARTAPI_sentFrame(APIFramePayload_t *data, uint16_t length)
{
  uint16_t i;
  uint8_t crc = 0;
  txAPIFrame.header.delimiter = UARTFrame_Delimiter;
  /* convert from little-endian to big-endian */
  SWAP_UINT16(length);
  txAPIFrame.header.length = length;
  USART_write((char const*)&txAPIFrame, sizeof(APIFrameHeader_t));
  for (i=0; i<length; i++)
  {
    if ( (data[i] == UARTFrame_Delimiter) || (data[i] == UARTFrame_Escape_Character) || (data[i] == UARTFrame_XON) || (data[i] == UARTFrame_XOFF) ) {
      USART_putc(UARTFrame_Escape_Character);
      USART_putc(data[i]^0x20);
    }
    else {
      USART_putc(data[i]);
    }
    crc += data[i];
  }
  crc = 0xff-crc;
  txAPIFrame.crc = crc;
  USART_putc(crc);
}

/**
 * Reads different system parametes via AT commands
 * Prepares and sents tx frame according to the atCommand requested.
 * @param data Pointer to data received within UART API frame
*/
void UARTAPI_readParameter(APIFramePayload_t *data)
{
  uint16_t atCommand;
  /* get AT command and convert to little-endian */
  atCommand = data[UARTAPI_ATCOMMAND_COMMAND] << 8 | data[UARTAPI_ATCOMMAND_COMMAND + 1];
  /* Prepare general tx frame data. Copy frame ID an AT command to sent frame */  
  txAPIFrame.data[0] = UARTAPI_ATCOMMAND_RESPONSE;
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_FRAMEID] = data[UARTAPI_ATCOMMAND_FRAMEID];
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_COMMAND] = data[UARTAPI_ATCOMMAND_COMMAND];
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_COMMAND + 1] = data[UARTAPI_ATCOMMAND_COMMAND + 1];
  /* as we will handle response status for each command, preset command status to "invalid command" */
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_INVALID_CMD;
  switch (atCommand)
  {
  case UARTAPI_ATCOMMAND_WRITE:
    /* not really a read but as it has no parameter it will be handled here */
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    break;
  case UARTAPI_ATCOMMAND_RESTOREDEFAULTS:
    /* not really a read but as it has no parameter it will be handled here */
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    break;
  case UARTAPI_ATCOMMAND_SOFTWARERESET:
    /* not really a read but as it has no parameter it will be handled here */
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    /* Trigger watchdog one more time to make sure that UART tx buffer can be emptied before watchdog reset */
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA);
    WDT_trigger();
    while (1)
    {
      nop();
    }
    break;
  case UARTAPI_ATCOMMAND_CHANNEL:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA] = CC2530Bee_Config.IEEE802154_config.Channel;
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(uint8_t));
    break;
  case UARTAPI_ATCOMMAND_PANID:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    *((IEEE802154_PANIdentifier_t*)&(txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA])) = CC2530Bee_Config.IEEE802154_config.PanID;
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(IEEE802154_PANIdentifier_t));
    break;
  case UARTAPI_ATCOMMAND_DESTINATIONADDRESSHIGH:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 0] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[4];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 1] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[5];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 2] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[6];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 3] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[7];
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(IEEE802154_ExtendedAddress_t)/2);
    break;
  case UARTAPI_ATCOMMAND_DESTINATIONADDRESSLOW:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 0] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[0];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 1] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[1];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 2] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[2];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 3] = IEEE802154_TxDataFrame.destinationAddress.extendedAdress[3];
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(IEEE802154_ExtendedAddress_t)/2);
    break;
  case UARTAPI_ATCOMMAND_SOURCEADDRESS16BIT:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    *((IEEE802154_ShortAddress_t*)&(txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA])) = IEEE802154_TxDataFrame.sourceAddress.shortAddress;
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(IEEE802154_ShortAddress_t));
    break;
  case UARTAPI_ATCOMMAND_SERIALNUMBERHIGH:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 0] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[4];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 1] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[5];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 2] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[6];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 3] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[7];
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(IEEE802154_ExtendedAddress_t)/2);
    break;
  case UARTAPI_ATCOMMAND_SERIALNUMBERLOW:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 0] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[0];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 1] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[1];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 2] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[2];
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_DATA + 3] = IEEE802154_TxDataFrame.sourceAddress.extendedAdress[3];
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA + sizeof(IEEE802154_ExtendedAddress_t)/2);
    break;
  default:
    break;
  }
}

/**
 * Sets different system parametes via AT commands
 * If parameter is handled OK will be sent back if no invalid command is sent via UART
 * @param data Pointer to data received within UART API frame
*/
void UARTAPI_setParameter(APIFramePayload_t *data)
{
  uint16_t atCommand;
  /* get AT command and convert to little-endian */
  atCommand = data[UARTAPI_ATCOMMAND_COMMAND] << 8 | data[UARTAPI_ATCOMMAND_COMMAND + 1];
  /* Prepare general tx frame data. Copy frame ID an AT command to sent frame */  
  txAPIFrame.data[0] = UARTAPI_ATCOMMAND_RESPONSE;
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_FRAMEID] = data[UARTAPI_ATCOMMAND_FRAMEID];
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_COMMAND] = data[UARTAPI_ATCOMMAND_COMMAND];
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_COMMAND + 1] = data[UARTAPI_ATCOMMAND_COMMAND + 1];
  /* As we will handle response status for each command, preset command status to "invalid command" */
  txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_INVALID_CMD;
  switch (atCommand)
  {
  case UARTAPI_ATCOMMAND_CHANNEL:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    /* Only set new configuration here, changes will be done later in main loop */
    CC2530Bee_Config.IEEE802154_config.Channel = data[UARTAPI_ATCOMMAND_DATA];
    CC2530BeeState = CC2530BeeState_ReInitIEEE802154;
    /* fall through */
  case UARTAPI_ATCOMMAND_PANID:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    CC2530Bee_Config.IEEE802154_config.PanID = *((IEEE802154_PANIdentifier_t*)&data[UARTAPI_ATCOMMAND_DATA]);
    /* fall through */
  case UARTAPI_ATCOMMAND_DESTINATIONADDRESSHIGH:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[4] = data[UARTAPI_ATCOMMAND_DATA];
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[5] = data[UARTAPI_ATCOMMAND_DATA + 1];
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[6] = data[UARTAPI_ATCOMMAND_DATA + 2];
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[7] = data[UARTAPI_ATCOMMAND_DATA + 3];
    /* fall through */
  case UARTAPI_ATCOMMAND_DESTINATIONADDRESSLOW:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[0] = data[UARTAPI_ATCOMMAND_DATA];
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[1] = data[UARTAPI_ATCOMMAND_DATA + 1];
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[2] = data[UARTAPI_ATCOMMAND_DATA + 2];
    IEEE802154_TxDataFrame.destinationAddress.extendedAdress[3] = data[UARTAPI_ATCOMMAND_DATA + 3];
    /* fall through */
  case UARTAPI_ATCOMMAND_SOURCEADDRESS16BIT:
    txAPIFrame.data[UARTAPI_ATCOMMAND_RESPONSE_STATUS] = UARTAPI_ATCOMMAND_RESPONSE_STATUS_OK;
    IEEE802154_TxDataFrame.sourceAddress.shortAddress = *((IEEE802154_ShortAddress_t*)&data[UARTAPI_ATCOMMAND_DATA]);
    /* fall through */
  case UARTAPI_ATCOMMAND_SERIALNUMBERHIGH:
    /* 64bit address can't be changed */
    /* fall through */
  case UARTAPI_ATCOMMAND_SERIALNUMBERLOW:
    /* 64bit address can't be changed */
    /* fall through */
  default:
    /* all above cases are missing break-statement but just set response status. Sent UART frame now */
    UARTAPI_sentFrame(txAPIFrame.data, UARTAPI_ATCOMMAND_RESPONSE_DATA);
    break;
  }
}

/**
 * Callback whenever Beacon frame was received
 * @param payloadLength Length of data in IEEE802154_RxDataFrame.payload
 * @param rssi value measured over the firs eight symbols following SFD
 * @note This function runs in interrupt context
*/
void IEEE802154_UserCbk_BeaconFrameReceived(uint8_t payloadLength, sint8_t rssi)
{
  
